Revit 2026 API

# ViewRemoveCalloutParent Method

---

Replaces callout parent ID with InvalidElementId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCalloutParent()
```
```vb
Public Sub RemoveCalloutParent
```
```cpp
public:
void RemoveCalloutParent()
```
```fsharp
member RemoveCalloutParent : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view is not a callout. |

Nothing is done if the callout has already no parent.

#### Reference

View Class

Autodesk.Revit.DB Namespace